all_news = [
{
    "id":1,
    "title": "МВД оценило ущерб от звонков о минировании в 300 млн рублей‍",
    "text": "Министерство внутренних дел (МВД) России подсчитало, что ущерб от эвакуации граждан из-за массовых звонков о минировании по всей России составил 300 млн руб. Об этом сообщает РБК со ссылкой на источники.",
    "date": "2016-03-25"
},

{
    "id":2,
    "title": "Блогер Юрий Хованский удалил ролики о банкире Олеге Тинькове",
    "text": "Блогер Юрий Хованский удалил свои ролики о банкире Олеге Тинькове, основателе Тинькофф-банка. Господин Хованский на своей странице «Вконтакте» написал, что остается при своем мнении, но больше не может выражать его публично.",
    "date": "2016-04-30"
},

{
    "id":3,
    "title": "В Петербурге построят крупнейший в мире планетарий",
    "text": "В Петербурге в здании дореволюционного газохранилища на Обводном канале построят крупнейший в мире планетарий. Как сообщает пресс-служба Смольного, проект был одобрен на заседании совета по инвестициям.",
    "date": "2016-07-28"
}

]

